benchmarks/TRACKS-MT3-GM-0.log
[info] Loading project definition from /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/project
[info] Set current project to benchmarks (in build file:/Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/)
Simulation com.azavea.ca.benchmark.MesaTracksStress started...

================================================================================
2016-10-01 14:44:07                                           5s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-10-01 14:44:12                                          10s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:17                                          15s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:22                                          20s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:27                                          25s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:32                                          30s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:37                                          35s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:42                                          40s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:47                                          45s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
> level-8, 27-day                                          (OK=2      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:52                                          50s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 5-day                                           (OK=1      KO=0     )
> level-8, 27-day                                          (OK=2      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:57                                          55s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=9      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=2      KO=0     )
> level-8, 5-day                                           (OK=2      KO=0     )
> level-8, 27-day                                          (OK=2      KO=0     )
> level-8, 1-week                                          (OK=1      KO=0     )
> level-8, 18-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:45:02                                          60s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=13     KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=3      KO=0     )
> level-8, 5-day                                           (OK=3      KO=0     )
> level-8, 27-day                                          (OK=4      KO=0     )
> level-8, 1-week                                          (OK=1      KO=0     )
> level-8, 18-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:45:03                                          60s elapsed
---- Tracks Pyramid: GeoMesa ---------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:1     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15     KO=0     )
> level-8, 9-day                                           (OK=2      KO=0     )
> level-8, 1-month                                         (OK=3      KO=0     )
> level-8, 5-day                                           (OK=3      KO=0     )
> level-8, 27-day                                          (OK=4      KO=0     )
> level-8, 1-week                                          (OK=2      KO=0     )
> level-8, 18-day                                          (OK=1      KO=0     )
================================================================================

Simulation com.azavea.ca.benchmark.MesaTracksStress completed in 60 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                         15 (OK=15     KO=0     )
> min response time                                    460 (OK=460    KO=-     )
> max response time                                   9395 (OK=9395   KO=-     )
> mean response time                                  3976 (OK=3976   KO=-     )
> std deviation                                       3651 (OK=3651   KO=-     )
> response time 50th percentile                       1626 (OK=1626   KO=-     )
> response time 75th percentile                       8098 (OK=8098   KO=-     )
> response time 95th percentile                       9295 (OK=9295   KO=-     )
> response time 99th percentile                       9375 (OK=9375   KO=-     )
> mean requests/sec                                  0.246 (OK=0.246  KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                             5 ( 33%)
> 800 ms < t < 1200 ms                                   0 (  0%)
> t > 1200 ms                                           10 ( 67%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/target/gatling/mesatracksstress-1475347442584/index.html
[info] Simulation MesaTracksStress successful.
[info] Simulation(s) execution ended.
[success] Total time: 63 s, completed Oct 1, 2016 2:45:03 PM